import img1 from "../../images/articlesList/mobilnyj-razrabotchik.webp";
import img2 from "../../images/articlesList/mobile-guide.webp";
import img3 from "../../images/articlesList/mobile-step.jpg"

const articlesList = {
    mobileArticles : [
        {
            id: 1,
            title: "Мобільний розробник: обов’язки та необхідні навички",
            description: "Мобільний розробник – це фахівець, який займається створенням і розробкою мобільних додатків для смартфонів і планшетів. Він відповідає за створення функціональних і привабливих застосунків для розв’язання різноманітних завдань, що надають зручний доступ до інформації та забезпечують позитивний користувацький досвід.",
            img: img1,
            reference: "https://foxminded.ua/mobilnyi-rozrobnyk/"
        },
        {
            id: 2,
            title: "Розробка мобільних додатків від А до Я: повний гайд",
            description: "Якщо ще пару століть назад в різних частинах світу людей масово охоплювала Золота лихоманка, то зараз з упевненістю можна сказати, що сучасний світ цілком і повністю поглинений мобільною лихоманкою. Чи знайдеться у вашому оточенні хоча б одна людина, яка не користується смартфоном? Та яке там. Продажі смартфонів зростають з блискавичною швидкістю, а компанії-виробники вкладають величезні суми в мобільні технології, їх розвиток і популяризацію на ринку. Мобільна розробка – дуже стрімко зростаюча область програмування, адже кількість мобільних пристроїв значно перевищує кількість персональних комп’ютерів, і ця тенденція буде тільки зростати.",
            img: img2,
            reference: "https://dan-it.com.ua/uk/blog/rozrobka-mobilnih-dodatkiv-vid-a-do-ja-povnij-gajd/"
        },
        {
            id: 3,
            title: "Розробка мобільних додатків: поради та практичні рекомендації",
            description: "У цій статті ми розглянемо поради та практичні рекомендації щодо розробки мобільних додатків у позашкільній освіті, які допоможуть створити інноваційні та ефективні інструменти для навчання.",
            img: img3,
            reference: "https://bdut.co.ua/pro-nas/rozrobka-mobilnyh-dodatkiv/"
        }
    ]
}

export default articlesList